HELLO_MESSAGE = "Привет ✌️\n"\
                "Вы можете классифицировать свой отзыв и найти характеристику актёра или персонажа."
UNKNOWN_COMMAND = 'Непонятная команда. Давайте посмотрим справку /help!'
HELP_MESSAGE = "Я бот-анализатор отзывов на фильмы!\n"\
               "Перейдите в меню и выберите нужное действие!'"


ASK_ACTION = 'Что Вы хотите сделать?'
ASK_REVIEW = 'Напишите отзыв о чём-либо'
ASK_NAME = "Введите имя человека, про которого Вы хотите узнать"


TASK_ASK_CLF_SENTIMENT_TEXT = 'Хочу узнать тональность отзыва!'
TASK_ASK_PERS_INFO = 'Каков конкретный человек?'
SEARCH_ALL_FILMS = 'Искать по всем фильмам'
CHOOSE_FILM_OR_REFUSE = f"Выберите фильм для поиска личности или выберите '{SEARCH_ALL_FILMS}'"


POSITIVE_LABEL = '😄Позитивный😄'
NEGATIVE_LABEL = '😞Негативный😞'


SHORT_MESSAGE_WARNING = 'Рецензия слишком коротка. Требуемая длина рецензии > 10 слов. Давайте начнём сначала.'
EMPTY_NAME_WARNING = 'Вы ввели некорректное имя персоны. Давайте начнём сначала.'
NO_FILMS_BY_NAME_WARNING = 'Нет фильмов, в которых присутствует персона. Давайте начнём сначала.'
NO_PROPER_CHARACTERISTICS = 'Нет хороших характеристих по заданным параметрам :('

WAITING_FOR_PERSON_INFO_RESPONSE_ANSWER = 'Поиск... Максимальное время ожидания: 5 минут.'
